#181
apart=[["101호","102호"],["201호","202호"],["301호","302호"]]

#182
stock=[["시가",100,200,300],["종가",80,210,330]]

#183
stock={"시가":[100,200,300],"종가":[80,210,330]}

#184
stock={"10/10":[80,110,70,90],"10/11":[210,230,190,200]}

#185
apart = [ [101, 102], [201, 202], [301, 302] ]
for x in apart:
    for y in x:
        print(y,"호",end="")
        #101 호102 호201 호202 호301 호302 호

print()
#186
for x in apart[::-1]:
    for y in x:
        print(y,"호",end="")
        #301 호302 호201 호202 호101 호102 호
print()
#187
for x in apart[::-1]:
    for y in x[::-1]:
        print(y,"호",end="")
        #302 호301 호202 호201 호102 호101 호

#188
for x in apart:
    for y in x:
        print(y,"호")
        print("-----")
'''
-----
102 호
-----
201 호
'''

#189
for x in apart:
    for y in x:
        print(y,"호")
    print("-"*5)

'''
101 호
102 호
-----
'''

#190
for x in apart:
    for y in x:
        print(y,"호")
print("-"*5)